Repository: lastquestion/hddtemp
Catalog: debian/po/*.po
Languages: sv

source: Should /usr/sbin/hddtemp be installed SUID root?
sv: Vill du att /usr/sbin/hddtemp ska installeras som SUID root?

source: You have the option of installing hddtemp with the SUID bit set, allowing it to be run (reporting hard drive temperatures) by regular users and not only the superuser.
sv: Du kan installera hddtemp med SUID, då kan programmet köras av vanliga användare och inte bara superanvändare.

source: This could potentially allow hddtemp to be used during an attack against the computer's security. If in doubt, do not choose this option.
sv: Detta kan bidra till att intrång kan genomföras om det skulle finnas fel i hddtemp som någon nyttjar för att skaffa otillåten åtkomst. Om du är minsta osäker ska du inte aktivera detta alternativ.

source: This setting can be modified later by running 'dpkg-reconfigure hddtemp'.
sv: Denna inställning kan ändras senare genom att köra 'dpkg-reconfige hddtemp'

source: Interval between hard drive temperature checks:
sv: Intervall mellan temperaturmätningar:

source: The temperature of the hard drive(s) can be logged by hddtemp via the generic system logging interface.
sv: Temperaturen för hårddisken/hårddiskarna kan loggas i det vanliga loggningssystemet.

source: Please enter a value in seconds corresponding to the interval between two checks. To disable this feature, enter 0.
sv: Ange ett värde i sekunder som anger intervallen mellan två mätningar. För att inaktivera den här funktionen, ange 0 som värde.

source: Should the hddtemp daemon be started at boot?
sv: Vill du starta hddtemp-tjänsten när systemet startas upp?

source: The hddtemp program can be run as a daemon, listening on port 7634 for incoming connections. It is used by some software such as gkrellm to get the temperature of hard drives.
sv: hddtemp kan köras som en tjänst som lyssnar på port 7634 efter inkommande anslutningar. Den används av programvara såsom gkrellm för att läsa av temperaturen på hårddiskarna.

source: You have the option of starting the hddtemp daemon automatically on system boot. If in doubt, it is suggested to not start it automatically on boot.
sv: Du har alternativet att starta hddtemp-tjänsten automatiskt när datorn startas upp. Om du är osäker föreslår jag att du inte startar den automatiskt vid uppstarten.

source: Interface to listen on:
sv: Gränssnitt att lyssna på:

source: The hddtemp program can listen for incoming connections on a specific interface, or on all interfaces.
sv: hddtemp kan lyssna efter inkommande anslutningar på specifika nätverksgränssnitt eller på gränssnitt.

source: To listen on a specific interface, enter the IP address of that interface (choosing 127.0.0.1 will accept local connections only). To listen on all interfaces, enter 0.0.0.0.
sv: För att lyssna på ett specifik nätverkgränssnitt, ange IP-adressen på det gränssnittet (127.0.0.1, vilket är standardvärdet för gränssnittet lo). För att lyssna på alla, ange 0.0.0.0.

source: Port to listen on:
sv: Port att lyssna på:

source: By default, hddtemp listens for incoming connections on port 7634. This can be changed for another port number.
sv: Som standard lyssnar hddtemp efter inkommande anslutningar på port 7634. Om du anser att denna port inte är lämplig kan du ange en annan port här.
